










#  CLI tools
echo "Installing CLI tools..."
brew install git
brew install node
brew install yarn
brew install azure-cli
brew install azcopy
brew install helm
brew install mkcert
brew install ncdu
brew install starship
brew install thefuck
brew install tidy-html5
brew install python@3.10


# manual steps
echo "Install Bettersnaptool (https://folivora.ai/bettersnaptool/) manually from the App Store"











# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'homebrew/bundle'
tap "buo/cask-upgrade"

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
#brew 'gh'
brew 'git'
brew 'jq'
#brew 'gnupg'
#brew 'grep'
#brew 'httpie'
#brew 'httping'
#brew 'mackup'
brew 'mas' # Mac App Store manager
#brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
#brew 'optipng'
#brew 'pngquant'
#brew 'svgo'
#brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.1'
brew 'composer'
brew 'imagemagick'
#brew 'mysql'
#brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'wget'
brew 'awscli'
brew 'rust'
brew 'python'
brew 'pyenv'
brew 'ext4fuse'

# Apps
cask '1password-beta'
cask 'rar'
cask 'spotify'
cask 'the-unarchiver'
cask 'nordvpn'
cask 'vlc'
cask 'clipy'
cask 'transmission'
cask 'hiddenbar'
cask 'macfuse'
cask 'balenaetcher'
cask dropbox
#cask 1password
cask tunnelblick
cask plex
cask stats
cask cakebrew
cask whatsapp
cask switch
cask steam



## communication tools
cask slack
cask discord
cask microsoft-teams
cask microsoft-outlook

## Development Apps
cask ngrok
cask phpstorm
cask postman
cask visual-studio-code
cask warp
cask docker
cask chromedriver
cask poedit
cask transmit
cask sourcetree
cask sketch
cask figma
cask imageoptim
cask gas-mask
cask 'arduino'
cask 'quicklook-json'



## browsers
cask 'firefox'
cask 'google-chrome'
cask 'microsoft-edge'

#cask 'microsoft-auto-update'
#cask 'microsoft-word'
#cask 'microsoft-excel'


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'

# Mac App Store
mas 'BetterSnapTool', id: 417375580
mas 'Microsoft Remote Desktop', id: 1295203466
#mas 'Keynote', id: 409183694
#mas 'Numbers', id: 409203825
#mas 'iMovie', id: 408981434
