# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap "buo/cask-upgrade"

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
#brew 'gh'
brew 'git'
brew 'jq'
#brew 'gnupg'
#brew 'grep'
#brew 'httpie'
#brew 'httping'
#brew 'mackup'
brew 'mas' # Mac App Store manager
#brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
#brew 'optipng'
#brew 'pngquant'
#brew 'svgo'
#brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@8.2'
brew 'composer'
brew 'imagemagick'
#brew 'mysql'
#brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'wget'
brew 'awscli'
brew 'rust'
brew 'python'
brew 'pyenv'
brew 'ext4fuse'
brew 'azure-cli'
brew 'azcopy'
brew 'helm'
brew 'mkcert'
brew 'ncdu'
brew 'starship'
brew 'thefuck'
brew 'tidy-html5'

# Apps
cask '1password-beta'
#cask '1password'
cask 'rar'
cask 'spotify'
cask 'the-unarchiver'
cask 'nordvpn'
cask 'vlc'
cask 'clipy'
cask 'transmission'
cask 'hiddenbar'
cask 'macfuse'
# cask 'balenaetcher'
cask 'dropbox'
cask 'tunnelblick'
cask 'plex'
cask 'stats'
cask 'cakebrew'
cask 'switch'
cask 'steam'

# communication Apps
cask 'whatsapp'
cask 'slack'
cask 'discord'
cask 'microsoft-teams'
cask 'microsoft-outlook'

# Development Apps
cask 'ngrok'
cask 'phpstorm'
cask 'postman'
cask 'visual-studio-code'
cask 'warp'
cask 'docker'
cask 'chromedriver'
cask 'poedit'
cask 'transmit'
cask 'sourcetree'
cask 'sketch'
cask 'figma'
cask 'imageoptim'
cask 'gas-mask'
cask 'arduino'
cask 'quicklook-json'
cask 'sonos'

# browsers
cask 'firefox'
cask 'google-chrome'
cask 'microsoft-edge'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'

# Mac App Store
mas 'BetterSnapTool', id: 417375580
mas 'Microsoft Remote Desktop', id: 1295203466
#mas 'Keynote', id: 409183694
#mas 'Numbers', id: 409203825
#mas 'iMovie', id: 408981434